Revit 2027 API
BuiltInFailures.ViewFailures.InitialViewDeleted Property
 The starting view for the project has been deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InitialViewDeleted { get; }
Public Shared ReadOnly Property InitialViewDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InitialViewDeleted {
	FailureDefinitionId^ get ();
}
static member InitialViewDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace